_posts/2013-03-23-trans-people-should-not-be-allowed-to-pee.html
---
layout: post
title:  Trans people should not be allowed to pee!
snip:   Get all those trans/homo/bisexual people outta our public bathrooms!
---


<p>
Let's face it, trans people should not be allowed to use public
bathrooms for straight, cisgendered people. Trans people are
weird. Like, <b>really</b> weird. And they do make normal, straight people
immensely uncomfortable. As such, I am forced to agree with John
Kavanagh, and reinforce his claim that <a href="https://www.allout.org/en/actions/arizona">If you think someone is using a public bathroom that's the wrong gender for them, THEY SHOULD FACE THE JAIL!</a>
</p>
<p>
Now, unlike John, I hold a more extremist view on this subject. Why stop
at trans people? There are lots of other things that make normal,
straight people likewise uncomfortable. For example, this scenario:
</p>
<blockquote>

<p>You're a white, christian, straight man, making your way over to the
public bathroom in a STEM convention. You decide to use the urinals,
like any normal person would in this occasion. At this point, another
man (if we ever could call that&hellip; <b>disgusting thing</b> that), looks at
you and stops at the urinal at your side. He pulls out his dick, still
staring at you, making faces at you. HOLY MOTHER OF FUCKS HE'S MAKING
FACES AT YOU! You feel violated, wishing all this awkward moment will
end as soon as possible. You feel an urge to punch him, but decide not
to: that would cause a huge commotion, and what if people think <b>you</b>
are gay too?! Oh, God forbid that!
</p>
</blockquote>


<p>
There's no denying that this sort of thing should not happen to normal,
white, straight men. Life is already way too difficult as it is. And
these things, these feelings of being violated! Oh my dearest God, I can
not even think about these! As such, I propose we don't stop with just
potentially forbidding trans people from using public bathrooms, but
also homosexuals. Those disgusting, vile people!
</p>
<p>
However, by taking such actions, the international community and the
"human" rights community might be upset at America<sup><a class="footref" name="fnr.1" href="#fn.1">1</a></sup>. People might
say we are not "inclusive" for people. Or that we're not a truly "free"
country. Or even utter bullshit like "We're not making progress, but
regressing instead!" Those fools! The 19th century was clearly more
developed in manners and society values as this century. We truly valued
masculinity back then. And now? Now we have these&hellip; oh I can't even
finish this phrase. It disgusts me so.
</p>
<p>
None the less, we want the Americans who might support this kind of
things to think we're being "inclusive", so I propose that besides
forbidding those weird fucks to use public bathrooms, we should do so
under the pretence of "We want to make Americans not feel violated when
using a public place.". This would mean that the rules for using public
bathrooms would have to change to the following:
</p>
<ul>
<li><p>Public bathroom usage would be defined by gender <b>and</b>
   sexual/romantic orientation. That is, you would only be able to use
   the public bathroom that fits your gender (with a distinction on
   cis/trans people), and your sexual orientation.</p>

<p>   
   So, <i>homosexual cis-men</i> would have to use a separate bathroom than
   an <i>heterosexual cis-men</i>, which is only reasonable. A <i>homosexual    trans-men</i> would not use the same public bathroom as a <i>homosexual    cis-men</i>, even more if that trans people haven't fully completed the
   procedures for sex reassignment yet.
</p>
<p>
   For <i>genderfluid</i> people, this mean we'd need an additional division,
   since those fuckers might feel like a man one day and a woman the
   other day. Disgusting!
</p></li>
</ul>



<ul>
<li><p>Public places, if providing public bathrooms, would be <b>required by    law</b> to provide bathrooms for every combination of gender and
   sexual/romantic orientations. Since we don't have a fixed number of
   these, this could potentially grow to infinity.</p>

<p>
   This would, of course, need to have a flaw in the law's writing such
   that a decent lawyer could use it to say "Oh, we're still trying to
   adapt to the changes, just give us a little more time." Of course, as
   long as the place has public bathrooms for <i>straight cis-men</i> and
   <i>straight cis-women</i>. If the place doesn't provide these, we should
   just fuck them up.
</p></li>
</ul>



<ul>
<li><p>People who are reported as using the wrong public bathroom for their
   gender or sexual/orientation will face a penalty according to how
   weird they are. Thus, <i>straight cis</i> people would just have to spend
   the night on the jail. Weird people would spend a lot more.</p>
</li>
</ul>





<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Conclusion</h2>
<div class="outline-text-2" id="text-1">


<p>
I really think this is the way America should go. To deny that people
who don't conform with the gender roles for their biological sex are
even people. This is a huge improvement from the 19th century, and I
believe perhaps even more than the Dark Age. It's likely to also be more
inclusive than the Nazi Germany, if we keep at it with all our
strength.
</p>
<p>
<a href="https://www.allout.org/en/actions/arizona">Let's together make America a better place for <i>straight, white, cis-men</i>, who are already way too bullied by their social position, and worse, threatened by this scourge of weird asses who insist in labelling themselves "human".</a>
</p>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">About this piece</h2>
<div class="outline-text-2" id="text-2">


<p>
I'm a genderfluid, asexual, panromantic person who was just way too
shocked with mister John Kavanagh's proposed law. If you don't get it,
this blog post is riddled with blatant sarcasm, and I'm just expressing
my support to the petition linked a few times throughout this post
(<a href="https://www.allout.org/en/actions/arizona">https://www.allout.org/en/actions/arizona</a>), by showing how absurd this
law really is :3
</p>


<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn.1" href="#fnr.1">1</a></sup> : I don't even know why it's called human rights, they defend the
        rights of gay and trans people, who clearly are not human.
</p></div>
</div>

</div>
</div>
